modm-ext/data.modm.io/docs/svd/header_stm32wba65xx.svd
        <register>
          <name>SECBB1R4</name>
          <description>FLASH bank 1 secure block-based bank register 4</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SECBB0</name>
              <description>Page 96 in Flash bank 1 block-based secure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB1</name>
              <description>Page 97 in Flash bank 1 block-based secure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB2</name>
              <description>Page 98 in Flash bank 1 block-based secure</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB3</name>
              <description>Page 99 in Flash bank 1 block-based secure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB4</name>
              <description>Page 100 in Flash bank 1 block-based secure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB5</name>
              <description>Page 101 in Flash bank 1 block-based secure</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB6</name>
              <description>Page 102 in Flash bank 1 block-based secure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB7</name>
              <description>Page 103 in Flash bank 1 block-based secure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB8</name>
              <description>Page 104 in Flash bank 1 block-based secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB9</name>
              <description>Page 105 in Flash bank 1 block-based secure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB10</name>
              <description>Page 106 in Flash bank 1 block-based secure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB11</name>
              <description>Page 107 in Flash bank 1 block-based secure</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB12</name>
              <description>Page 108 in Flash bank 1 block-based secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB13</name>
              <description>Page 109 in Flash bank 1 block-based secure</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB14</name>
              <description>Page 110 in Flash bank 1 block-based secure</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB15</name>
              <description>Page 111 in Flash bank 1 block-based secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB16</name>
              <description>Page 112 in Flash bank 1 block-based secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB17</name>
              <description>Page 113 in Flash bank 1 block-based secure</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB18</name>
              <description>Page 114 in Flash bank 1 block-based secure</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB19</name>
              <description>Page 115 in Flash bank 1 block-based secure</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB20</name>
              <description>Page 116 in Flash bank 1 block-based secure</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB21</name>
              <description>Page 117 in Flash bank 1 block-based secure</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB22</name>
              <description>Page 118 in Flash bank 1 block-based secure</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB23</name>
              <description>Page 119 in Flash bank 1 block-based secure</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB24</name>
              <description>Page 120 in Flash bank 1 block-based secure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB25</name>
              <description>Page 121 in Flash bank 1 block-based secure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB26</name>
              <description>Page 122 in Flash bank 1 block-based secure</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB27</name>
              <description>Page 123 in Flash bank 1 block-based secure</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB28</name>
              <description>Page 124 in Flash bank 1 block-based secure</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB29</name>
              <description>Page 125 in Flash bank 1 block-based secure</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB30</name>
              <description>Page 126 in Flash bank 1 block-based secure</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB31</name>
              <description>Page 127 in Flash bank 1 block-based secure</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBB2R1</name>
          <description>FLASH bank 2 secure block-based bank register 1</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SECBB0</name>
              <description>Page 0 in Flash bank 2 block-based secure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB1</name>
              <description>Page 1 in Flash bank 2 block-based secure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB2</name>
              <description>Page 2 in Flash bank 2 block-based secure</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB3</name>
              <description>Page 3 in Flash bank 2 block-based secure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB4</name>
              <description>Page 4 in Flash bank 2 block-based secure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB5</name>
              <description>Page 5 in Flash bank 2 block-based secure</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB6</name>
              <description>Page 6 in Flash bank 2 block-based secure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB7</name>
              <description>Page 7 in Flash bank 2 block-based secure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB8</name>
              <description>Page 8 in Flash bank 2 block-based secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB9</name>
              <description>Page 9 in Flash bank 2 block-based secure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB10</name>
              <description>Page 10 in Flash bank 2 block-based secure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB11</name>
              <description>Page 11 in Flash bank 2 block-based secure</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB12</name>
              <description>Page 12 in Flash bank 2 block-based secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB13</name>
              <description>Page 13 in Flash bank 2 block-based secure</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB14</name>
              <description>Page 14 in Flash bank 2 block-based secure</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB15</name>
              <description>Page 15 in Flash bank 2 block-based secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB16</name>
              <description>Page 16 in Flash bank 2 block-based secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB17</name>
              <description>Page 17 in Flash bank 2 block-based secure</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB18</name>
              <description>Page 18 in Flash bank 2 block-based secure</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB19</name>
              <description>Page 19 in Flash bank 2 block-based secure</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB20</name>
              <description>Page 20 in Flash bank 2 block-based secure</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB21</name>
              <description>Page 21 in Flash bank 2 block-based secure</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB22</name>
              <description>Page 22 in Flash bank 2 block-based secure</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB23</name>
              <description>Page 23 in Flash bank 2 block-based secure</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB24</name>
              <description>Page 24 in Flash bank 2 block-based secure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB25</name>
              <description>Page 25 in Flash bank 2 block-based secure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB26</name>
              <description>Page 26 in Flash bank 2 block-based secure</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB27</name>
              <description>Page 27 in Flash bank 2 block-based secure</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB28</name>
              <description>Page 28 in Flash bank 2 block-based secure</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB29</name>
              <description>Page 29 in Flash bank 2 block-based secure</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB30</name>
              <description>Page 30 in Flash bank 2 block-based secure</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB31</name>
              <description>Page 31 in Flash bank 2 block-based secure</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBB2R2</name>
          <description>FLASH bank 2 secure block-based bank register 2</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SECBB0</name>
              <description>Page 32 in Flash bank 2 block-based secure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB1</name>
              <description>Page 33 in Flash bank 2 block-based secure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB2</name>
              <description>Page 34 in Flash bank 2 block-based secure</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB3</name>
              <description>Page 35 in Flash bank 2 block-based secure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB4</name>
              <description>Page 36 in Flash bank 2 block-based secure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB5</name>
              <description>Page 37 in Flash bank 2 block-based secure</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB6</name>
              <description>Page 38 in Flash bank 2 block-based secure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB7</name>
              <description>Page 39 in Flash bank 2 block-based secure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB8</name>
              <description>Page 40 in Flash bank 2 block-based secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB9</name>
              <description>Page 41 in Flash bank 2 block-based secure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB10</name>
              <description>Page 42 in Flash bank 2 block-based secure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB11</name>
              <description>Page 43 in Flash bank 2 block-based secure</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB12</name>
              <description>Page 44 in Flash bank 2 block-based secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB13</name>
              <description>Page 45 in Flash bank 2 block-based secure</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB14</name>
              <description>Page 46 in Flash bank 2 block-based secure</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB15</name>
              <description>Page 47 in Flash bank 2 block-based secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB16</name>
              <description>Page 48 in Flash bank 2 block-based secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB17</name>
              <description>Page 49 in Flash bank 2 block-based secure</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB18</name>
              <description>Page 50 in Flash bank 2 block-based secure</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB19</name>
              <description>Page 51 in Flash bank 2 block-based secure</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB20</name>
              <description>Page 52 in Flash bank 2 block-based secure</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB21</name>
              <description>Page 53 in Flash bank 2 block-based secure</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB22</name>
              <description>Page 54 in Flash bank 2 block-based secure</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB23</name>
              <description>Page 55 in Flash bank 2 block-based secure</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB24</name>
              <description>Page 56 in Flash bank 2 block-based secure</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB25</name>
              <description>Page 57 in Flash bank 2 block-based secure</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB26</name>
              <description>Page 58 in Flash bank 2 block-based secure</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB27</name>
              <description>Page 59 in Flash bank 2 block-based secure</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB28</name>
              <description>Page 60 in Flash bank 2 block-based secure</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB29</name>
              <description>Page 61 in Flash bank 2 block-based secure</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB30</name>
              <description>Page 62 in Flash bank 2 block-based secure</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECBB31</name>
              <description>Page 63 in Flash bank 2 block-based secure</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
