modm-ext/data.modm.io/docs/svd/header_stm32wba65xx.svd
        <register>
          <name>PRIVBB2R3</name>
          <description>FLASH bank 2 privilege block-based bank register 3</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRIVBB0</name>
              <description>Page 64 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB1</name>
              <description>Page 65 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB2</name>
              <description>Page 66 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB3</name>
              <description>Page 67 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB4</name>
              <description>Page 68 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB5</name>
              <description>Page 69 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB6</name>
              <description>Page 70 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB7</name>
              <description>Page 71 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB8</name>
              <description>Page 72 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB9</name>
              <description>Page 73 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB10</name>
              <description>Page 74 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB11</name>
              <description>Page 75 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB12</name>
              <description>Page 76 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB13</name>
              <description>Page 77 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB14</name>
              <description>Page 78 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB15</name>
              <description>Page 79 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB16</name>
              <description>Page 80 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB17</name>
              <description>Page 81 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB18</name>
              <description>Page 82 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB19</name>
              <description>Page 83 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB20</name>
              <description>Page 84 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB21</name>
              <description>Page 85 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB22</name>
              <description>Page 86 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB23</name>
              <description>Page 87 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB24</name>
              <description>Page 88 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB25</name>
              <description>Page 89 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB26</name>
              <description>Page 90 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB27</name>
              <description>Page 91 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB28</name>
              <description>Page 92 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB29</name>
              <description>Page 93 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB30</name>
              <description>Page 94 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB31</name>
              <description>Page 95 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVBB2R4</name>
          <description>FLASH bank 2 privilege block-based bank register 4</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRIVBB0</name>
              <description>Page 96 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB1</name>
              <description>Page 97 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB2</name>
              <description>Page 98 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB3</name>
              <description>Page 99 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB4</name>
              <description>Page 100 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB5</name>
              <description>Page 101 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB6</name>
              <description>Page 102 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB7</name>
              <description>Page 103 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB8</name>
              <description>Page 104 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB9</name>
              <description>Page 105 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB10</name>
              <description>Page 106 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB11</name>
              <description>Page 107 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB12</name>
              <description>Page 108 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB13</name>
              <description>Page 109 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB14</name>
              <description>Page 110 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB15</name>
              <description>Page 111 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB16</name>
              <description>Page 112 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB17</name>
              <description>Page 113 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB18</name>
              <description>Page 114 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB19</name>
              <description>Page 115 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB20</name>
              <description>Page 116 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB21</name>
              <description>Page 117 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB22</name>
              <description>Page 118 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB23</name>
              <description>Page 119 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB24</name>
              <description>Page 120 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB25</name>
              <description>Page 121 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB26</name>
              <description>Page 122 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB27</name>
              <description>Page 123 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB28</name>
              <description>Page 124 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB29</name>
              <description>Page 125 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB30</name>
              <description>Page 126 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB31</name>
              <description>Page 127 in Flash bank 2 only accessible by privileged access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
